Revit 2024 API
TransactWithCentralOptions Members
The TransactWithCentralOptions type exposes the following members.
Constructors
Name | Description
TransactWithCentralOptions
 Constructs a new TransactWithCentralOptions.
Methods
Name | Description
Dispose
Releases all resources used by the TransactWithCentralOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLockCallback
 Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetLockCallback
 Sets or resets a callback object that would allow an external application to change Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
TransactWithCentralOptions Class
Autodesk.Revit.DB Namespace